In [2]:
import numpy as np
import pandas as pd
import re
import math

In [6]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [7]:
print(obj3['California'])

True

In [12]:
x = obj2['California']
obj2['California'] != x

True

In [10]:
print(math.isnan(obj2['California']))

True

In [11]:
print(obj2['California'] == None)

False

In [15]:
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)

In [18]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [19]:
S.iloc[0:2]

1    Alice
2      Bob
dtype: object

In [12]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [10]:

df = df.rename(mapper = lambda x: x.upper(), axis = 1)
df

   MONTH  YEAR  SALE
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [37]:
df = df.rename(mapper = lambda x: x.upper(), axis = 1)
df

   MONTH  YEAR  SALE
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [41]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [43]:
df.rename(mapper = lambda x: x.upper(), axis = 1)

   MONTH  YEAR  SALE
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [46]:
df.rename(mapper = lambda x: x.upper(), axis = 1, inplace = True)
df

   MONTH  YEAR  SALE
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [50]:
df1 = {'serial no.' : [1, 2, 3, 4, 5],
      'gre score' : [337, 324, 316, 322, 314],
      'toefl score' : [118, 107, 104, 110, 103]}

df1 = pd.DataFrame(df1)
df1.set_index('serial no.')

            gre score  toefl score
serial no.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [53]:
df1.where(df1['toefl score'] > 105)

   serial no.  gre score  toefl score
0         1.0      337.0        118.0
1         2.0      324.0        107.0
2         NaN        NaN          NaN
3         4.0      322.0        110.0
4         NaN        NaN          NaN

In [54]:
df1[df1['toefl score'] > 105]

   serial no.  gre score  toefl score
0           1        337          118
1           2        324          107
3           4        322          110

In [55]:
df1.where(df1['toefl score'] > 105).dropna()

   serial no.  gre score  toefl score
0         1.0      337.0        118.0
1         2.0      324.0        107.0
3         4.0      322.0        110.0

In [61]:
df1 = {'state' : ['Ohio', 'Colorado', 'Utah', 'New York','Manila'],
      'one' : [337, 324, 316, 322, 314],
      'two' : [118, 107, 104, 110, 103], 
       'three' : [337, 324, 316, 322, 314],
       'four' : [118, 107, 104, 110, 103]
      }

df1 = pd.DataFrame(df1)
df2 = df1.set_index('state')

df2

          one  two  three  four
state
Ohio      337  118    337   118
Colorado  324  107    324   107
Utah      316  104    316   104
New York  322  110    322   110
Manila    314  103    314   103

In [63]:
df2.drop('Ohio')

          one  two  three  four
state
Colorado  324  107    324   107
Utah      316  104    316   104
New York  322  110    322   110
Manila    314  103    314   103

In [64]:
df2.drop('one', axis = 1)

          two  three  four
state
Ohio      118    337   118
Colorado  107    324   107
Utah      104    316   104
New York  110    322   110
Manila    103    314   103

In [65]:
df2.drop(['Utah', 'Colorado'])

          one  two  three  four
state
Ohio      337  118    337   118
New York  322  110    322   110
Manila    314  103    314   103

In [66]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [70]:
s2[1]

2

In [71]:
df1 = {'serial no.' : [1, 2, 3, 4, 5],
      'gre score' : [337, 324, 316, 322, 314],
      'toefl score' : [118, 107, 104, 110, 103]}

df1 = pd.DataFrame(df1)
df1.set_index('serial no.')

            gre score  toefl score
serial no.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [76]:
df1[(df1['toefl score'] > 105) & (df1['toefl score'] < 115)]

   serial no.  gre score  toefl score
1           2        324          107
3           4        322          110

In [85]:
data = {'Major' : ['Mathematics', 'Sociology'],
       'Name' : ['Alice', 'Jack'],
       'Age': [20, 22],
       'Gender' : ['F', 'M']
       }

data = pd.DataFrame(data)
data1 = data.set_index('Major')
data1

              Name  Age Gender
Major
Mathematics  Alice   20      F
Sociology     Jack   22      M

In [87]:
data1.T['Mathematics']

Name      Alice
Age          20
Gender        F
Name: Mathematics, dtype: object